In [1]:
import sqlite3
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/4GeeksAcademy/machine-learning-content/master/assets/titanic_train.csv')
#df.index=df['PassengerId']
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [2]:
maximo=df['Fare'].max()
maximo

512.3292

In [3]:
# Nos conectamos a la base de datos ejemplo.db (la crea si no existe)
con = sqlite3.connect("titanic.db")

In [4]:
df.to_sql('passengers', con, if_exists='replace')

Responder a las siguientes preguntas usando SQL sobre la tabla que acabáis de crear:  
1) Cuántos supervivientes hay (columna Survived)

In [5]:
cursor = con.execute("SELECT count(survived) from passengers WHERE Survived=1")
for i in cursor:
    print(i[0])

342

2) De todos los pasajeros, cuántos hombres y mujeres hay (columna Sex)

In [6]:
cursor = con.execute("SELECT sex,count(sex) from passengers GROUP BY sex")
for i in cursor:
    print(i[0],'=',i[1])

female = 314
male = 577

3) Cuál es el valor del ticket más caro que se compró (columna Fare)

In [7]:
cursor = con.execute("SELECT  name,fare from passengers WHERE fare = (SELECT MAX(Fare) FROM passengers order by fare)")
for i in cursor:
    print(i)

('Ward, Miss. Anna', 512.3292)
('Cardeza, Mr. Thomas Drake Martinez', 512.3292)
('Lesurer, Mr. Gustave J', 512.3292)

In [8]:
con.close()